README.html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml"
lang="en" xml:lang="en">
<head>
<title>OpenFOAM README for version 1.7.x</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="30 June 2010"/>
<meta name="author" content="OpenCFD Ltd."/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
</head>
<body>
<div id="content">

<h1 class="title">OpenFOAM README for version 1.7.x</h1>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 About OpenFOAM </a></li>
<li><a href="#sec-2">2 Copyright </a></li>
<li><a href="#sec-3">3 Download and installation instructions </a></li>
<li><a href="#sec-4">4 Documentation </a></li>
<li><a href="#sec-5">5 Support and development contracts </a></li>
<li><a href="#sec-6">6 Reporting Bugs in OpenFOAM </a></li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> About OpenFOAM </h2>
<div class="outline-text-2" id="text-1">

<p>OpenFOAM is a free, open source computational fluid dynamcis (CFD) software
package produced by a commercial company, OpenCFD Ltd. It has a large user
base across most areas of engineering and science, from both commercial and
academic organisations. OpenFOAM has an extensive range of features to solve
anything from complex fluid flows involving chemical reactions, turbulence and
heat transfer, to solid dynamics and electromagnetics.
</p>
</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Copyright </h2>
<div class="outline-text-2" id="text-2">

<p>OpenFOAM is free software: you can redistribute it and/or modify it under the
terms of the GNU General Public License as published by the Free Software
Foundation, either version 3 of the License, or (at your option) any later
version.  See the file <a href="./COPYING">COPYING</a> in this directory, for a
description of the GNU General Public License terms under which you can copy
the files.
</p>
</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Download and installation instructions </h2>
<div class="outline-text-2" id="text-3">

<ul>
<li>
To install the Ubuntu/Debian (.deb) pack, see
<a href="http://www.OpenFOAM.com/download/ubuntu.php">http://www.OpenFOAM.com/download/ubuntu.php</a>
</li>
<li>
To install the source (.gtgz) pack, see
<a href="http://www.OpenFOAM.com/download/source.php">http://www.OpenFOAM.com/download/source.php</a>
</li>
<li>
To install from the Git repository, see
<a href="http://www.OpenFOAM.com/download/git.php">http://www.OpenFOAM.com/download/git.php</a>

</li>
</ul>
</div>

</div>

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Documentation </h2>
<div class="outline-text-2" id="text-4">

<p><a href="http://www.OpenFOAM.com/docs">http://www.OpenFOAM.com/docs</a>
</p>
</div>

</div>

<div id="outline-container-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> Support and development contracts </h2>
<div class="outline-text-2" id="text-5">

<p><a href="http://www.OpenFOAM.com/support">http://www.OpenFOAM.com/support</a>
</p>
</div>

</div>

<div id="outline-container-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> Reporting Bugs in OpenFOAM </h2>
<div class="outline-text-2" id="text-6">

<p><a href="http://www.OpenFOAM.com/bugs">http://www.OpenFOAM.com/bugs</a>
</p></div>
</div>
<div id="postamble">
<p class="date"> Date: 30 June 2010</p>
<p class="creator">HTML generated by org-mode 6.34trans in emacs 23</p>
</div>
</div>
</body>
</html>
